In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [4]:
df1=pd.read_csv("test.csv", encoding='latin_1')

In [5]:
df1.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [6]:
df1.shape

(418, 11)

In [7]:
df2=pd.read_csv("train.csv", encoding='latin_1')

In [8]:
df2.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [9]:
df2.shape

(891, 12)

In [10]:
df3=pd.read_csv("gender_submission.csv", encoding='latin_1')

In [11]:
df3.head()

   PassengerId  Survived
0          892         0
1          893         1
2          894         0
3          895         0
4          896         1

In [12]:
df3.shape

(418, 2)

In [13]:
df1.columns

Index(['PassengerId', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch',
       'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [14]:
df2.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [15]:
df3.columns

Index(['PassengerId', 'Survived'], dtype='object')

In [16]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Pclass       418 non-null    int64
 2   Name         418 non-null    object
 3   Sex          418 non-null    object
 4   Age          332 non-null    float64
 5   SibSp        418 non-null    int64
 6   Parch        418 non-null    int64
 7   Ticket       418 non-null    object
 8   Fare         417 non-null    float64
 9   Cabin        91 non-null     object
 10  Embarked     418 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 36.1+ KB

In [17]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [18]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Survived     418 non-null    int64
dtypes: int64(2)
memory usage: 6.7 KB

In [20]:
survived_count = df2['Survived'].sum()

In [22]:
died_count = df2['Survived'].count()-survived_count

In [23]:
total_passengers = df2['Survived'].count()
survival_rate = (survived_count / total_passengers) * 100
death_rate = (died_count / total_passengers) * 100

In [24]:
males_survived = df2[(df2['Sex'] == 'male') & (df2['Survived'] == 1)].shape[0]
males_died = df2[(df2['Sex'] == 'male') & (df2['Survived'] == 0)].shape[0]
females_survived = df2[(df['Sex'] == 'female') & (df2['Survived'] == 1)].shape[0]
females_died = df2[(df2['Sex'] == 'female') & (df2['Survived'] == 0)].shape[0]

In [25]:
avg_age_survived = df2[df2['Survived'] == 1]['Age'].mean()
avg_age_died = df2[df2['Survived'] == 0]['Age'].mean()

In [26]:
print("A. Number of people survived the disaster:", survived_count)
print("B. Number of people died:", died_count)
print("C. Survival rate: {:.2f}%".format(survival_rate))
print("   Death rate: {:.2f}%".format(death_rate))
print("D. Males survived:", males_survived)
print("   Males died:", males_died)
print("E. Females survived:", females_survived)
print("   Females died:", females_died)
print("F. Average age of survivors:", avg_age_survived)
print("   Average age of non-survivors:", avg_age_died)

A. Number of people survived the disaster: 342
B. Number of people died: 549
C. Survival rate: 38.38%
   Death rate: 61.62%
D. Males survived: 109
   Males died: 468
E. Females survived: 54
   Females died: 81
F. Average age of survivors: 28.343689655172415
   Average age of non-survivors: 30.62617924528302